remove mermaid (#17)
